package com.aeyoung.postit.communitys;

import android.app.Activity;
import android.os.Bundle;
import android.widget.ExpandableListView;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;

public class ScheduleActivity extends Activity {

    ExpandableListAdapter listAdapter;
    ExpandableListView expListView;
    List<String> listDataHeader;
    HashMap<String, List<String>> listDataChild;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_schedule);

        // get the listview
        expListView = (ExpandableListView) findViewById(R.id.lvExp);

        // preparing list data
        prepareListData();

        listAdapter = new ExpandableListAdapter(this, listDataHeader, listDataChild);

        // setting list adapter
        expListView.setAdapter(listAdapter);
    }

    /*
     * Preparing the list data
     */
    private void prepareListData() {
        listDataHeader = new ArrayList<String>();
        listDataChild = new HashMap<String, List<String>>();

        // Adding child data
        listDataHeader.add("2019년 3월");
        listDataHeader.add("2019년 4월");
        listDataHeader.add("2019년 5월");
        listDataHeader.add("2019년 6월");
        listDataHeader.add("2019년 7월");
        listDataHeader.add("2019년 8월");
        listDataHeader.add("2019년 9월");
        listDataHeader.add("2019년 10월");
        listDataHeader.add("2019년 11월");
        listDataHeader.add("2019년 12월");
        listDataHeader.add("2020년 1월");
        listDataHeader.add("2020년 2월");


        // Adding child data
        List<String> num0 = new ArrayList<String>();
        num0.add("2019학년도 1학기 개강(2019.03.04 (월))");
        num0.add("1학기 공휴보강계획 수립/ 신·편입생 수강신청(2019.03.04일 (월) ~ 2019.03.08 (금))");
        num0.add("2018학년도 2학기+겨울학기 성적 최종 등록(2019.03.18 (월)~ 2019.03.22 (금))");
        num0.add("2018학년도 2학기 해외대학 교류학점 신고/보고(2019.03.18 (월)~2019.03.29 (금))");
        num0.add("군 휴학자 복학마감일, 2019.03.29 (금)");

        List<String> num1 = new ArrayList<String>();
        num1.add("1학기 1차(1~4주) 강의진행 현황 및 총괄표 제출(2019.4.1 (월)~2019.4.4 (목))");
        num1.add("수업일수 1/3선, 2019.04.05 (금)");
        num1.add("1학기 미복학 및 미등록자 제적(2019.04.08 (월)~2019.04.12 (금))");
        num1.add("2019년 8월 졸업대상자 졸업예비사정(2019.04.08 (월)~2019.04.19 (금))");
        num1.add("2019학년도 전기 학점포기신청(2019.04.15 (월)~2019.04.19 (금))");
        num1.add("여름학기 수업준비(계획수립, 조교회의 등)(2019.04.22(월)~2019.04.26(금))");
        num1.add("1학기 수시평가 기간(2019.04.22(월)~2019.04.26(금))");
        num1.add("1학기 졸업종합시험(교양 /전공) / 모의토익 원서접수(2019.04.22(월)~2019.04.26(금))");
        num1.add("수업일수 1/2선, 2019.04.24 (수)");
        num1.add("여름학기 수업운영계획 수립 및 준비(2019.04.24 (수)~2019.04.30 (화))");
        num1.add("1학기 2차(5~8주) 강의진행 현황 및 총괄표 제출(2019.04.29 (월)~2019.05.03 (금))");
        num1.add("1학기 수강철회(2019.04.29 (월)~2019.05.03 (금))");


        List<String> num2 = new ArrayList<String>();
        num2.add("근로자의날(임시휴일), 2019.05.01 (수)");
        num2.add("여름학기 개설예상 과목 검토(2019.05.01 (수)~2019.05.03 (금))");
        num2.add( "1학기 수강철회(2019.04 29 (월)~2019.05.03 (금))");
        num2.add("어린이날, 2019.05.05 (일)");
        num2.add("어린이날 대체공휴일, 2019.05.06 (월)");
        num2.add("여름학기 과목 개설 및 분반 설정(2019.05.07 (화)~2019.05.09 (목))");
        num2.add("수업일수 2/3선, 2019.05.10 (수)");
        num2.add("여름학기 시간표 등록(2019.05.13 (월)~2019.05.15 (수))");
        num2.add( "여름학기 복학신청((2019.05.13 (월)~2019.05.17 (금))");
        num2.add("여름학기 수강신청((2019.05.20 (월)~2019.05.22 (수))");
        num2.add("1학기 모의토익시험((2019.05.22 (수)~2019.05.23 (목))");
        num2.add("여름학기 1차 합·폐강 진행(2019.05.23 (목)~2019.05.29 (수))");
        num2.add("조기졸업, 학사학위취득 유예 신청(2019.05.23 (목)~2019.05.29 (수))");
        num2.add("여름학기 인턴쉽 신청(2019.05.27(월)~2019.06.07 (금))");
        num2.add("1학기 졸업종합시험(교양/전공)(2019.05.27 (월)~2019.06.14 (금))");
        num2.add("1학기 3차(9~12주) 강의진행 현황 및 총괄표 제출(2019.05.27 (월)~2019.05.31 (금))");

        List<String> num3 = new ArrayList<String>();
        num3.add("여름학기 추가 수강신청(시간표 중복자)(2019.06.03 (월)~2019.06.05 (수))");
        num3.add("현충일, 2019.06.06 (목)");
        num3.add("여름학기 인턴십 신청마감,  2019.06.07 (금)");
        num3.add("1학기 정기평가(2019.06.10. (월)~2019.06.21 (금))");
        num3.add( "1학기 종강, 2019.06.14 (금)");
        num3.add("1학기 보강주(2019.06.17 (월)~2019.06.21 (금))");
        num3.add( "여름학기 개강, 2019.06.24 (월)");
        num3.add ("1학기 4차(13~16주) 강의진행 현황 및 총괄표 제출(2019.06.24 (월)~2019.06.28 (금))");
        num3.add("1학기 성적입력기간((2019.06.24 (월)∼2019.07.05 (금))");
        num3.add ("2학기 수업 계획 수립 및 준비((2019.06.24 (월)∼2019.06.28 (금))");



        List<String> num4 = new ArrayList<String>();
        num4.add("1학기 성적입력기간(1∼4학년)(2019.06.24 (월)~ 2019.07.05 (금))");
        num4.add( "2학기 개설예상 과목 검토(2019.07.01 (월)~2019.07.05 (금))");
        num4.add( "여름학기 1차 수강철회(1∼3주 수업)(2019.07.04 (목)~2019.07.05 (금))");
        num4.add("1학기 성적공고 및 확인(2019.07.08 (월)~2019.07.12 (금))");
        num4.add("여름학기 1차(1~2주) 강의진행 현황 및 총괄표 제출(2019.07.08 (월)~2019.07.10 (수))");
        num4.add("2학기 과목 개설 및 분반설정(2019.07.08 (월)~2019.07.10 (수))");
        num4.add( "여름학기 수업일수 1/2선, 2019.07.10 (수)");
        num4.add("2학기 시간표 입력기간(2019.07.15 (월)~2019.07.17 (수))");
        num4.add( "2학기 복학신청(2019.07.15 (월)~2019.07.26 (금))");
        num4.add("전과 및 재입학 신청(2019.07.17 (수)~2019.07.24 (수))");
        num4.add("여름학기 2차 수강철회(1∼5주, 3∼5주 수업)(2019.07.18 (목)~2019.07.19 (금))");
        num4.add("2019년 8월 졸업사정(2019.07.22 (월)~2019.08.09 (금))");
        num4.add("2학기 수강신청(2019.07.22 (월)~2019.07.26 (금))");
        num4.add("2학기 휴학신청(2019.07.25 (목)~2019.07.31 (수))");
        num4.add("여름학기 종강, 2019.07.26 (금)");
        num4.add("여름학기 2차(3~5주) 강의진행 현황 및 총괄표 제출(2019.07.29 (월)~2019.07.31 (수))");
        num4.add("2학기 1차 합·폐강(2019.07.29 (월)~2019.08.02 (금))");
        num4.add("여름학기 성적입력(2019.07.29 (월)~2019.08.02 (금))");

        List<String> num5= new ArrayList<String>();
        num5.add("2학기 1차 합·폐강(2019.07.29 (월)~2019.08.02 (금)");
        num5.add( "여름학기 성적입력(2019.07.29 (월)~2019.08.02일 (금))");
        num5.add( "여름학기 성적공고 및 확인(2019.08.05 (월)~2019.08.07 (수))");
        num5.add("2학기 추가 수강신청 및 변경(시간표 중복자)(2019.08.07 (수)~2019.08.09 (금))");
        num5.add( "1학기+여름학기 학사경고(2019.08.12 (월)~2019.08.23 (금))");
        num5.add( "2학기 2차 합·폐강(2019.08.12 (월)~2019.08.16 (금))");
        num5.add( "광복절, 2019.08.15 (목)");
        num5.add("2019년 8월 졸업사정 마감, 2019.08.16 (금)");
        num5.add( "2학기 인턴십 신청마감, 2019.08.16 (금)");
        num5.add("2학기 등록금 납부기간(2019.08.19. (월)~2019.08.23 (금))");
        num5.add( "2019년 8월 학위수여식, 2019.08.23 (금)");
        num5.add( "2학기 개강, 2019.08.26 (월)");
        num5.add("2학기 신·편입, 유학생 수강신청(2019.08.26 (월)~2019.08.30 (금))");
        num5.add("2학기 공휴보강계획 수립((2019.08.26 (월)~2019.08.30 (금))");

        List<String> num6 = new ArrayList<String>();
        num6.add("1학기 해외대학 교류학점 등록/보고(2019.09.09 (월)~2019.09.20(금))");
        num6.add("추석, 2019.09.12 (목)");
        num6.add( "추석, 2019.09.13 (금)");
        num6.add( "추석, 2019.09.14 (토)");
        num6.add("군휴학자 복학마감일, 2019.09.20 (금)");
        num6.add( "2019학년도 1학기+여름학기 성적 최종 등록(2019.09.23 (월)~2019.09.27 (금))");
        num6.add("2학기 1차(1~4주) 강의진행 현황 및 총괄표 제출(2019.09.23(월)~2019.09.27 (금))");
        num6.add("2학기 졸업종합시험 및 모의토익 원서접수 마감(2019.09.25 (수)~2019.10.08 (화))");
        num6.add("2학기 수업일수 1/3선, 2019.09.27 (금)");
        num6.add("2학기 미복학 및 미등록 제적(2019.09.30 (월)~2019.10.04 (금))");

        List<String> num7 = new ArrayList<String>();
        num7.add("개천절, 2019.10.3 (목)");
        num7.add("2학기 미복학 및 미등록 제적(2019.09.30 (월)~2019.10.04 (금))");
        num7.add("2020학년도 교육과정 편성 계획 수립(2019.10월01 (화)~2019.10.04 (금))");
        num7.add ("2020년 2월 졸업대상자 졸업예비사정(2019.10.07 (월)~2019.10.18 (금))");
        num7.add("졸업종합시험 및 모의토익 원서접수 마감, 2019.10.08 (화))");
        num7.add("한글날,  2019.10.09 (수)");
        num7.add("2학기 수시평가 기간(2019.10.14(월) ~2019.10.18 (금), 22 (화))");
        num7.add("2019학년도 후기 학점포기 신청(2019.10.14 (월)~2019.10.21 (월))");
        num7.add("개교기념일, 2019.10.15 (화)");
        num7.add("2학기 수업일수 1/2선, 2019.10.18 (금)");
        num7.add("2학기 2차(5~8주) 강의진행 현황 및 총괄표 제출(2019.10.21 (월)~2019.10.25 (금))");
        num7.add("2학기 수강철회(21일~25일), 2019.10.21 (월)");
        num7.add("겨울학기 수업운영 계획 및 준비(2019.10.21 (월)~2019.10.25 (금))");
        num7.add("2학기 모의토익시험(2019.10.23 (수)~2019.10.24 (목))");
        num7.add("겨울학기 개설 예상과목 검토((2019.10.28 (월)~2019.11.01(금))");;

        List<String> num8 = new ArrayList<String>();
        num8.add("겨울학기 개설 예상과목 검토(2019.10.28 (월)∼2019.11.01 (금))");
        num8.add("2학기 수업일수 2/3선, 2019.11.01 (금)");
        num8.add("겨울학기 과목 개설 및 분반설정(2019.11.04 (월)∼2019.11.06 (수))");
        num8.add("겨울학기 수업 시간표 등록(2019.11.11(월)∼2019.11.13 (수))");
        num8.add("겨울학기 복학신청(2019.11.11 (월)∼2019.11.22 (금))");
        num8.add("부전공(부,복수,트랙)신청(2019.11.11 (월)∼2019.11.22 (금))");
        num8.add("2학기 3차(9~12주) 강의진행 현황 및 총괄표 제출(2019.11.18 (월)∼2019.11.22 (금))");
        num8.add("겨울학기 수강신청(2019.11월18일(월)∼2019.11월20일(수))");
        num8.add("2020년 2월 조기졸업 및 학사학위취득 유예 신청(2019.11.21 (목)∼2019.11.27 (수))");
        num8.add("겨울학기 합폐강 진행(2019.11.21 (목)∼2019.11.27 (수))");
        num8.add("2학기 졸업종합시험실시(전공)(2019.11.25 (월)∼2019.12.06 (금))");
        num8.add("겨울학기 수강신청 추가 및 변경(시간표 중복자)(2019.11.28 (목)~2019.11.29일(금))");

        List<String> num9 = new ArrayList<String>();
        num9.add("2학기 졸업종합시험(2019.11.25 (월)∼2019.12.06 (금))");
        num9.add("겨울학기 인턴십 신청마감(2019.11.25 (월)∼2019.12.06 (금)) ");
        num9.add("2학기 정기평가(2019.12.02 (월)~2019.12.13 (금))");
        num9.add("2020학년도 교육과정 심의 및 확정(2019.12.03 (화)∼2019.12.14 (토))");
        num9.add("2학기 종강 , 2019.12.06 (금)");
        num9.add("2학기 보강주(2019.12.0 9(월)∼2019.12.13 (금))");
        num9.add("2020학년도 전공배정 신청(2019.12.09 (월)∼2019.12.13 (금))");
        num9.add("2020학년도 1학기 수업운영계획 수립 및 준비(2019.12.09 (월)∼2019.12.13 (금))");
        num9.add("겨울학기 개강, 2019.12.16 (월)");
        num9.add("2020학년도 1학기 개설예상 과목 검토 및 확인(2019.12.16 (월)∼2019.12.20 (금))");
        num9.add("2학기 성적입력(2019.12.16 (월)∼2019.12.27 (금))");
        num9.add("2학기 4차(13~16주) 강의진행 현황 및 총괄표 제출(2019.12.23 (월)∼2019.12.27 (금))");
        num9.add("2020학년도 1학기 과목 개설 및 분반설정(2019.12.23 (월)∼2019.12.27 (금))");
        num9.add("2019학년도 1학기 복학신청(2019.12.23 (월)∼2020.1.03 (금))");
        num9.add("성탄절, 2019.12.25 (수)");
        num9.add("겨울학기 1차 수강철회(1∼3주 강좌)(2019.12.26 (목)∼2019.12.27 (금))");
        num9.add("2학기 성적공고 및 확인(2019.12.30 (월)∼2020.1.06 (월)");

        List<String> num10 = new ArrayList<String>();
        num10.add("겨울학기 수업일수 1/2선, 2020.01.02 (목)");
        num10.add("2020학년도 1학기 전과 및 재입학 신청기간(2020.01.02 (목)∼2020.01.08 (수))");
        num10.add("2020학년도 1학기 복학신청 1차 마감, 2020.01.03 (금)");
        num10.add("겨울학기 1차(1~3주) 강의진행 현황 및 총괄표 제출(2020.01.06 (월)∼2020.01.10 (금)))");
        num10.add("겨울학기 2차 수강철회(1∼5주, 3∼5주 강좌)(2020.01.09 (목)∼2020.01.10 (금)");
        num10.add("1학기 수업 시간표 등록(2020.01.6 (월)∼2020.01.08 (수))");
        num10.add("2020학년도 1학기 수강신청(2020.01.13 (월)∼2020.01.17 (금)))");
        num10.add("2020년 2월 졸업사정(2020.01.13 (월)∼2020.02.07 (금))");
        num10.add("2020학년도 1학기 휴학신청기간(2020.01.16 (목)∼2020.01.22 (수))");
        num10.add("겨울학기 종강, 2020.01.17 (금)");
        num10.add("겨울학기 2차(4~5주) 강의진행 현황 및 총괄표 제출(2020.01.20 (월)∼2020.01.23 (목))");
        num10.add("2020학년도 1학기 1차 합·폐강(2020.01.20 (월)∼2020.01.23 (목))");
        num10.add("겨울학기 성적입력기간(2020.01.20 (월)∼2020.01.23 (목))");
        num10.add("설날, 2020.01.24 (금)");
        num10.add("설날, 2020.01.25 (토)");
        num10.add("설날, 2020.01.26 (일)");
        num10.add("설날 대체공휴일, 2020.01.27 (월)");
        num10.add("2019학년도 1학기 추가수강신청 및 변경(시간표 중복자)(2020.01.29 (수)∼2020.01.31 (금))");
        num10.add("겨울학기 성적공고 및 확인(2020.01.29 (수)∼2020.01.31 (금))");

        List<String> num11 = new ArrayList<String>();
        num11.add("2020학년도 1학기 2차 합·폐강(2020.02.03 (월)~2020.02.07 (금))");
        num11.add( "2학기+겨울학기 학사경고자 확정 및 통보(2020.02.03 (월)~2020.02.14 (금))");
        num11.add( "2020년 2월 졸업사정 마감, 2020.02.07 (금)");
        num11.add( "2020학년도 1학기 등록금 납부기간(2020.02.17 (월)~2020.02.21 (토))");
        num11.add( "2020학년도 1학기 인턴쉽 신청마감(2020.02.17 (월)~2020.02.28 (금))");
        num11.add( "2020년 2월 학위수여식, 2020.02.21 (금)");
        num11.add("2020학년도 Sol Sup(신입생역량 프로그램) 1주차(2020.02.24 (월)~2020.03.06일 (금))");
        num11.add("2020학년도 입학식(수강신청), 2020.02.28 (금)");
        num11.add("윤년, 2020.02.29 (토)");

        listDataChild.put(listDataHeader.get(0), num0); // Header, Child data
        listDataChild.put(listDataHeader.get(1), num1);
        listDataChild.put(listDataHeader.get(2), num2);
        listDataChild.put(listDataHeader.get(3), num3);
        listDataChild.put(listDataHeader.get(4), num4);
        listDataChild.put(listDataHeader.get(5), num5);
        listDataChild.put(listDataHeader.get(6), num6);
        listDataChild.put(listDataHeader.get(7), num7);
        listDataChild.put(listDataHeader.get(8), num8);
        listDataChild.put(listDataHeader.get(9), num9);
        listDataChild.put(listDataHeader.get(10), num10);
        listDataChild.put(listDataHeader.get(11), num11);
    }
}